<script>
import ListMixin from '../listMixin';

export default {
  /*
    Пример использования миксина. Аналог ХОКов из React. Если есть общая
    функцилнальность в компонентах: данные, методы и т.д. Можно вынести в
    миксин - объект с дублирующим кодом.
    По умолчанию Vue использует данные из миксинна.
    Если есть одинаковые свойства или методы в компоненте и в миксине, то будут
    испольоватся с компонента, они главнее. В миксинах можно использовать всё
    что можно использовать в компонентах.
  */
  mixins: [ListMixin],
}

</script>

<template>
  <div>
    <h1>List</h1>

    <input type="text"  v-model="searchName" />
    <ul>
      <li v-for="name of filteredNames">{{ name }}</li>
    </ul>
  </div>
</template>
